# 예제 1-21 시리즈를 숫자로 나누기

In [1]:
import pandas as pd

### 딕셔너리 데이터로 판다스 시리즈 만들기

In [2]:
student1 = pd.Series({'국어': 100, '영어': 80, '수학': 90})
student1

국어    100
영어     80
수학     90
dtype: int64

### 학생의 과목별 점수를 200으로 나누기

In [3]:
percentage = student1/200
percentage

국어    0.50
영어    0.40
수학    0.45
dtype: float64

In [4]:
print(type(percentage))

<class 'pandas.core.series.Series'>

# 예제 1-22 시리즈 사칙연산

In [5]:
import pandas as pd

### 딕셔너리 데이터로 판다스 시리즈 만들기

In [6]:
student1 = pd.Series({'국어': 100, '영어': 80, '수학': 90})
student2 = pd.Series({'수학': 80, '국어': 90, '영어': 80})

In [7]:
student1

국어    100
영어     80
수학     90
dtype: int64

In [8]:
student2

수학    80
국어    90
영어    80
dtype: int64

### 두 학생의 과목별 점수로 사칙연산 수행

In [13]:
addition = student1 + student2 #덧셈

In [14]:
subtraction = student1 - student2 #뺄셈

In [15]:
multiplication = student1 * student2 #곱셈

In [16]:
division = student1 / student2 #나눗셈

두 시리즈의 인덱스 순서가 달라도 같은 것끼리 연산한다.

### 사칙연산 결과를 데이터프레임으로 합치기

In [20]:
result = pd.DataFrame([addition, subtraction, multiplication, division],
                     index = ['덧셈', '뺄셈', '곱셈', '나눗셈'])
result

              국어        수학      영어
덧셈    190.000000   170.000   160.0
뺄셈     10.000000    10.000     0.0
곱셈   9000.000000  7200.000  6400.0
나눗셈     1.111111     1.125     1.0

# 예제 1-23 NaN값이 있는 시리즈 연산

In [21]:
import pandas as pd 
import numpy as np

### 딕셔너리 데이터로 판다스 시리즈 만들기

In [24]:
student1 = pd.Series({'국어': np.nan, '영어': 80, '수학': 90})
student2 = pd.Series({'수학': 80, '국어': 90})

In [25]:
student1

국어     NaN
영어    80.0
수학    90.0
dtype: float64

In [26]:
student2

수학    80
국어    90
dtype: int64

### 두 학생의 과목별 점수로 사칙연산 수행(시리즈 vs 시리즈)

In [29]:
addition = student1 + student2 #덧셈

In [30]:
subtraction = student1 - student2 #뺄셈

In [31]:
multiplication = student1 * student2 #곱셈

In [32]:
division = student1 / student2 #나눗셈

### 사칙연산 결과를 데이터프레임으로 합치기

In [33]:
result = pd.DataFrame([addition, subtraction, multiplication, division],
                     index = ['덧셈', '뺄셈', '곱셈', '나눗셈'])
result

     국어        수학  영어
덧셈  NaN   170.000 NaN
뺄셈  NaN    10.000 NaN
곱셈  NaN  7200.000 NaN
나눗셈 NaN     1.125 NaN

student1의 국어가 NaN값이다. NaN을 포함한 연산 결과는 모두 NaN으로 처리한다.<br>
student2의 영어 인덱스가 없기 때문에 result 객체에 영어 열 반환 값은 모두 NaN이다.

# 예제 1-24연산 메소드 사용 - 시리즈 연산

In [34]:
import pandas as pd 
import numpy as np

### 딕셔너리 데이터로 판다스 시리즈 만들기

In [35]:
student1 = pd.Series({'국어': np.nan, '영어': 80, '수학': 90})
student2 = pd.Series({'수학': 80, '국어': 90})

In [36]:
student1

국어     NaN
영어    80.0
수학    90.0
dtype: float64

In [37]:
student2

수학    80
국어    90
dtype: int64

### 두 학생의 과목별 점수로 사칙연산 수행(연산 메소드 사용)

In [43]:
sr_add = student1.add(student2, fill_value= 0) #덧셈

In [44]:
sr_sub = student1.sub(student2, fill_value= 0) #뺄셈

In [45]:
sr_mul = student1.mul(student2, fill_value= 0) #곱셈

In [46]:
sr_div = student1.div(student2, fill_value= 0) #나눗셈

### 사칙연산 결과를 데이터프레임으로 합치기

In [47]:
result = pd.DataFrame([sr_add, sr_sub, sr_mul, sr_div],
                     index = ['덧셈', '뺄셈', '곱셈', '나눗셈'])
result

       국어        수학    영어
덧셈   90.0   170.000  80.0
뺄셈  -90.0    10.000  80.0
곱셈    0.0  7200.000   0.0
나눗셈   0.0     1.125   inf

fill_value = 0 옵션을 설정하여 NaN을 0으로 대체한다.

# 예제 1-25 데이터프레임에 숫자 더하기

In [49]:
import pandas as pd 
import seaborn as sns

### titanic 데이터셋에서 age, fare 2개 열을 선택하여<br> 데이터프레임 만들기

In [50]:
titanic = sns.load_dataset('titanic')

In [52]:
df = titanic.loc[:, ['age', 'fare']]
df

      age     fare
0    22.0   7.2500
1    38.0  71.2833
2    26.0   7.9250
3    35.0  53.1000
4    35.0   8.0500
..    ...      ...
886  27.0  13.0000
887  19.0  30.0000
888   NaN  23.4500
889  26.0  30.0000
890  32.0   7.7500

[891 rows x 2 columns]

### 데이터프레임에 10 더하기

In [54]:
addition = df + 10
addition.head() # 첫 5행만 표시

    age     fare
0  32.0  17.2500
1  48.0  81.2833
2  36.0  17.9250
3  45.0  63.1000
4  45.0  18.0500

###

###